///////////////////////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ HTML-таблицы
///////////////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьТаблицу(HTMLТекст, Данные) Экспорт
	
	// открываем таблицу
	HTMLТекст	= HTMLТекст + Символы.ПС + "<table>";
	
	// шапка таблицы
	HTMLТекст	= HTMLТекст + Символы.ПС + "<tr>";
	
	Для каждого Кол из Данные.Колонки Цикл
		
		HTMLТекст	= HTMLТекст + Символы.ПС + "<th>" + Кол.Заголовок + "</th>";
		
	КонецЦикла;
	
	HTMLТекст	= HTMLТекст + Символы.ПС + "</tr>";
	
	// тело таблицы
	Для каждого Стр из Данные Цикл
		
		HTMLТекст	= HTMLТекст + Символы.ПС + "<tr>";
		
		Для каждого Кол из Данные.Колонки Цикл
			
			HTMLТекст	= HTMLТекст + Символы.ПС + "<th>" + Стр[Кол.Имя] + "</th>";
			
		КонецЦикла;
		
		HTMLТекст	= HTMLТекст + Символы.ПС + "</tr>";
		
	КонецЦикла;
	
	// закрываем таблицу
	HTMLТекст	= HTMLТекст + Символы.ПС + "</table>";
	
	Возврат HTMLТекст;
	
КонецФункции