Процедура НачальноеЗаполнениеКонстант() Экспорт
	
	Если ПустаяСтрока(Константы.IPАдресВебСервиса.Получить()) Тогда
		Константы.IPАдресВебСервиса.Установить("86.102.58.78:8008");
	КонецЕсли;
	
	Если ПустаяСтрока(Константы.ИмяПубликации.Получить()) Тогда
		Константы.ИмяПубликации.Установить("yeti_cup");
	КонецЕсли;

КонецПроцедуры

Функция CоздатьПрокси(ПредварительнаяПроверка = Ложь) Экспорт
	
	Попытка
		
		ИПСервиса		= СокрЛ(Константы.IPАдресВебСервиса.Получить());
		ИмяПубликации	= СокрЛ(Константы.ИмяПубликации.Получить());
		
		АдресВебСервиса	= "http://" + ИПСервиса + "/" + ИмяПубликации + "/ws/api?wsdl";
		ИмяВебСервиса	= "api";
		
		Определение		= Новый WSОпределения(АдресВебСервиса, "", "");
		
		Если ПредварительнаяПроверка Тогда
			
			Прокси = Новый WSПрокси(Определение, ИмяВебСервиса, ИмяВебСервиса, ИмяВебСервиса + "Soap",,7);
			Прокси.Пользователь = "";
			Прокси.Пароль       = "";
			Прокси.Ping();
			
		КонецЕсли;
		
		Прокси = Новый WSПрокси(Определение, ИмяВебСервиса, ИмяВебСервиса, ИмяВебСервиса + "Soap");
		Прокси.Пользователь = "";
		Прокси.Пароль       = "";
		
	Исключение
		
		Сообщить("Не удалось подключиться к веб-сервису!");
		Прокси = Неопределено;	
		
	КонецПопытки;
	
	Возврат Прокси;
	
КонецФункции