&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		АдресКартинки	= ПоместитьВоВременноеХранилище(Объект.Ссылка.event_pictures.Получить(), ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ПутьКФайлу	= "";
	
	ДиалогВыбораФайла	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файл картинки (*.jpg)|*.jpg|" +
							"Файл картинки (*.jpeg)|*.jpeg|" +
							"Файл картинки (*.png)|*.png|" +
							"Файл картинки (*.bmp)|*.bmp";
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл с фото события'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ПутьКФайлу		= ДиалогВыбораФайла.ПолноеИмяФайла;

		АдресКартинки	= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор);
		
	    Оповещение		= Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
	    НачатьПомещениеФайлаНаСервер(Оповещение, , , АдресКартинки, ПутьКФайлу, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
    
    Модифицированность = Истина;
    
КонецПроцедуры

&НаСервере
Процедура ПерелЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ТекущийОбъект.event_pictures = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	КонецЕсли;
	
КонецПроцедуры
