
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// если элемент существует
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ВремФайл				= ПолучитьИмяВременногоФайла(Строка(Объект.ТипЭлемента));
		Объект.Ссылка.Данные.Получить().Записать(ВремФайл);
		
		ТекстовыйДокумент		= Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ВремФайл, КодировкаТекста.UTF8);
				
		ПредставлениеЭлемента	= ТекстовыйДокумент.ПолучитьТекст();
		
		Для каждого Страница из Элементы.Представление.ПодчиненныеЭлементы Цикл
			
			Страница.Видимость	= (Страница.Имя = Строка(Объект.ТипЭлемента));
			
		КонецЦикла;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
