
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		АдресКартинки	= ПоместитьВоВременноеХранилище(Объект.Ссылка.photo.Получить(), ЭтаФорма.УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ПутьКФайлу	= "";
	
	ДиалогВыбораФайла	= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = "Файл картинки (*.jpg)|*.jpg|" +
							"Файл картинки (*.jpeg)|*.jpeg|" +
							"Файл картинки (*.png)|*.png|" +
							"Файл картинки (*.bmp)|*.bmp";
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл с фото пользователя'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра = 0;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ПутьКФайлу		= ДиалогВыбораФайла.ПолноеИмяФайла;

		АдресКартинки	= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), ЭтаФорма.УникальныйИдентификатор);
		
	    Оповещение		= Новый ОписаниеОповещения("ЗагрузитьКартинкуЗавершение", ЭтотОбъект);
	    НачатьПомещениеФайлаНаСервер(Оповещение, , , АдресКартинки, ПутьКФайлу, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
    
    Модифицированность = Истина;
    
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ТекущийОбъект.photo = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьQRкодНаСервере()
	
	СтрокаДляQRКода	= Объект.fitst_name + "|" +
					Объект.second_name + "|" +
					Объект.last_name + "|" + 
					Объект.user_id.Код;
					
	ДанныеQRКода	= ФормированиеQR.ПолучитьQRкод(СтрокаДляQRКода, 0, 190);
	
	Возврат ПоместитьВоВременноеХранилище(Новый Картинка(ДанныеQRКода), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции


&НаКлиенте
Процедура ПолучитьQRкод(Команда)
	
	QRкод		= ПолучитьQRкодНаСервере();
	
	Параметров	= Новый Структура("QR", QRкод);
	
	ОткрытьФорму("Справочник.Profile.Форма.ФормаQR", Параметров, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

